import { PartnersType } from '@/types/components/partners';

export const PARTNERS_MOCK: PartnersType = {
  heading_text: 'Делимся опытом и технологическими решениями',
  image_main: '/content/images/people.jpg',
  alt_main: 'people',
  title_main: 'people',
  what_offer_text: 'VisionLabs предлагает уникальный опыт в компьютерном зрении и выгодные',
  reasons: {
    title: '7 причин стать партнером VisionLabs',
    list: [
      {
        id: 1,
        name: 'Многопрофильная экспертиза',
        preview_text: 'Выгодные условия для партнеров позволяют им выигрывать тендеры без ущерба для маржинальности. Мы предлагаем скидки и финансовые инструменты, которые адаптируются к вашим задачам.',
      },
      {
        id: 2,
        name: 'Гибкая коммерческая политика',
        preview_text: 'Выгодные условия для партнеров позволяют им выигрывать тендеры без ущерба для маржинальности. Мы предлагаем скидки и финансовые инструменты, которые адаптируются к вашим задачам.',
      },
      {
        id: 3,
        name: 'Решения для любого масштаба',
        preview_text: 'Выгодные условия для партнеров позволяют им выигрывать тендеры без ущерба для маржинальности. Мы предлагаем скидки и финансовые инструменты, которые адаптируются к вашим задачам.',
      },
      {
        id: 4,
        name: 'Опыт международной работы',
        preview_text: 'Выгодные условия для партнеров позволяют им выигрывать тендеры без ущерба для маржинальности. Мы предлагаем скидки и финансовые инструменты, которые адаптируются к вашим задачам.',
      },
      {
        id: 5,
        name: 'Растущий рынок технологий',
        preview_text: 'Выгодные условия для партнеров позволяют им выигрывать тендеры без ущерба для маржинальности. Мы предлагаем скидки и финансовые инструменты, которые адаптируются к вашим задачам.',
      },
      {
        id: 6,
        name: 'Легкая интеграция',
        preview_text: 'Выгодные условия для партнеров позволяют им выигрывать тендеры без ущерба для маржинальности. Мы предлагаем скидки и финансовые инструменты, которые адаптируются к вашим задачам.',
      },
      {
        id: 7,
        name: 'Сильное партнерское сообщество',
        preview_text: 'Выгодные условия для партнеров позволяют им выигрывать тендеры без ущерба для маржинальности. Мы предлагаем скидки и финансовые инструменты, которые адаптируются к вашим задачам.',
      }
    ],
  },
  leaders: {
    count: 41,
    is_last: false,
    list: [
      {
        id: 1,
        title: 'ЦБТ',
        subtitle: 'Оператор ЕБС',
        description: 'C 2022 года — оператор ГИС «Единая биометрическая система», одного из ключевых проектов цифровой инфраструктуры РФ. АО «ЦБТ» обеспечивает сбор, хранение, обработку и проверку биометрических персональных данных с учетом требований законодательства.',
        logo: '/content/logo/cbt.png',
        logo_alt: 'ЦБТ',
        logo_title: 'ЦБТ',
        isUseMockImage: true,
      },
      {
        id: 2,
        title: 'НСПК',
        subtitle: 'Оператор платежной системы МИР',
        description: 'АО «НСПК» обеспечивает независимость платежной инфраструктуры России. НСПК выпускает карты «Мир» и развивает Систему быстрых платежей. Компания внедряет доступные и удобные платежные сервисы, поддерживая суверенитет страны и формируя стандарты индустрии.',
        logo: '/content/logo/nspk.png',
        logo_alt: 'НСПК',
        logo_title: 'НСПК',
        isUseMockImage: true,
      },
      {
        id: 3,
        title: 'ЦРТ',
        subtitle: 'VMS',
        description: 'Группа компаний ЦРТ — ведущий разработчик решений на основе разговорного ИИ, машинного обучения и компьютерного зрения. Эксперт в речевых технологиях, лицевой и голосовой биометрии. В России технологии ЦРТ используются в банках, госсекторе, ТЭК и концепции Safe & Smart City.',
        logo: '/content/logo/crt.png',
        logo_alt: 'ЦРТ',
        logo_title: 'ЦРТ',
        isUseMockImage: true,
      },
      {
        id: 4,
        title: 'Нетрис',
        subtitle: 'VMS',
        description: 'Ведущий разработчик интеллектуальных решений в области видеонаблюдения для умных городов, регионов и крупного бизнеса. На базе технологий АО «Нетрис» создается Единая национальная платформа видеонаблюдения (ЕНПВ). Решения используются в России и СНГ.',
        logo: '/content/logo/netris.png',
        logo_alt: 'Нетрис',
        logo_title: 'Нетрис',
        isUseMockImage: true,
      },
      {
        id: 5,
        title: 'Алгонт',
        subtitle: 'VMS',
        description: 'АО «Алгонт» — российская IT-компания, специализирующаяся на разработке, проектировании, производстве и внедрении решений для комплексной безопасности объектов. Компания выполняет полный цикл работ — от проектирования до обслуживания «под ключ» инженерных систем.',
        logo: '/content/logo/algont.png',
        logo_alt: 'Алгонт',
        logo_title: 'Алгонт',
        isUseMockImage: true,
      },
      {
        id: 6,
        title: 'ITV Group',
        subtitle: 'VMS',
        description: 'Система видеоаналитики распознает транспорт и помогает оптимизировать трафик, снижая риск ДТПГК ITV Group объединяет разработчиков, производителей и поставщиков решений для физической безопасности. В ее состав среди прочих входит компания ITV — разработчик ПО для видеонаблюдения, интегрированных систем безопасности и нейросетевой видеоаналитики, применяемых по всему миру.',
        logo: '/content/logo/itv.png',
        logo_alt: 'ITV Group',
        logo_title: 'ITV Group',
        isUseMockImage: true,
      }
    ],
  },
};
